zohar123/ametal/soc/nxp/lpc845/lpc84x_pin.h
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2015 Guangzhou ZHIYUAN Electronics Stock Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
* e-mail:      ametal.support@zlg.cn
*******************************************************************************/

/**
 * \file
 * \brief LPC82x 引脚及配置参数定义
 * 
 * \note 1. 可转移功能可以配置所有I/O引脚；
 *          GPIO功能和特殊功能属于固定功能，只能搭配对应的引脚使用 \n
 *          示例：PIO0_0引脚功能配置： \n 
 *          - 配置为GPIO功能使用宏：      PIO0_0_GPIO \n
 *          - 配置为比较器输入功能使用宏：PIO0_0_ACMP_I1 \n
 *          - 配置串口发送引脚功能使用宏：PIO_FUNC_U0_TXD
 *
 * \note 2. 复用功能方向由自身决定，PIOx_x_GPIO_INPUT或PIOx_x_GPIO_OUTPUT
 *          会将引脚配置为普通IO输入输出功能 
 *
 * \internal
 * \par Modification History
 * - 1.01 15-11-24  mem, modified.
 * - 1.02 15-07-28  zxl, modified.
 * - 1.00 15-07-08  zxl, first implementation.
 * \endinternal
 */

#ifndef __LPC84X_PIN_H
#define __LPC84X_PIN_H

#include "am_lpc84x_gpio_util.h"

#ifdef __cplusplus
extern "C" {
#endif

 /** 
 * \addtogroup lpc82x_if_pin
 * \copydoc lpc82x_pin.h
 * @{
 */

/** 
 * \name LPC8xx 引脚编号
 * @{
 */

#define PIO0_0          0        /**< \brief PIO0_0 引脚号 */
#define PIO0_1          1        /**< \brief PIO0_1 引脚号 */
#define PIO0_2          2        /**< \brief PIO0_2 引脚号 */
#define PIO0_3          3        /**< \brief PIO0_3 引脚号 */
#define PIO0_4          4        /**< \brief PIO0_4 引脚号 */
#define PIO0_5          5        /**< \brief PIO0_5 引脚号 */
#define PIO0_6          6        /**< \brief PIO0_6 引脚号 */
#define PIO0_7          7        /**< \brief PIO0_7 引脚号 */
#define PIO0_8          8        /**< \brief PIO0_8 引脚号 */
#define PIO0_9          9        /**< \brief PIO0_9 引脚号 */
#define PIO0_10         10       /**< \brief PIO0_10引脚号 */
#define PIO0_11         11       /**< \brief PIO0_11引脚号 */
#define PIO0_12         12       /**< \brief PIO0_12引脚号 */
#define PIO0_13         13       /**< \brief PIO0_13引脚号 */
#define PIO0_14         14       /**< \brief PIO0_14引脚号 */
#define PIO0_15         15       /**< \brief PIO0_15引脚号 */
#define PIO0_16         16       /**< \brief PIO0_16引脚号 */
#define PIO0_17         17       /**< \brief PIO0_17引脚号 */
#define PIO0_18         18       /**< \brief PIO0_18引脚号 */
#define PIO0_19         19       /**< \brief PIO0_19引脚号 */
#define PIO0_20         20       /**< \brief PIO0_20引脚号 */
#define PIO0_21         21       /**< \brief PIO0_21引脚号 */
#define PIO0_22         22       /**< \brief PIO0_22引脚号 */
#define PIO0_23         23       /**< \brief PIO0_23引脚号 */
#define PIO0_24         24       /**< \brief PIO0_24引脚号 */
#define PIO0_25         25       /**< \brief PIO0_25引脚号 */
#define PIO0_26         26       /**< \brief PIO0_26引脚号 */
#define PIO0_27         27       /**< \brief PIO0_27引脚号 */
#define PIO0_28         28       /**< \brief PIO0_28引脚号 */
#define PIO0_29         29       /**< \brief PIO0_29引脚号 */
#define PIO0_30         30       /**< \brief PIO0_30引脚号 */
#define PIO0_31         31       /**< \brief PIO0_31引脚号 */

#define PIO1_0          32       /**< \brief PIO1_0引脚号 */
#define PIO1_1          33       /**< \brief PIO1_1引脚号 */
#define PIO1_2          34       /**< \brief PIO1_2引脚号 */
#define PIO1_3          35       /**< \brief PIO1_3引脚号 */
#define PIO1_4          36       /**< \brief PIO1_4引脚号 */
#define PIO1_5          37       /**< \brief PIO1_5引脚号 */
#define PIO1_6          38       /**< \brief PIO1_6引脚号 */
#define PIO1_7          39       /**< \brief PIO1_7引脚号 */
#define PIO1_8          40       /**< \brief PIO1_8引脚号 */
#define PIO1_9          41       /**< \brief PIO1_9引脚号 */
#define PIO1_10         42       /**< \brief PIO1_10引脚号 */
#define PIO1_12         43       /**< \brief PIO1_12引脚号 */
#define PIO1_13         44       /**< \brief PIO1_13引脚号 */
#define PIO1_14         45       /**< \brief PIO1_14引脚号 */
#define PIO1_15         46       /**< \brief PIO1_15引脚号 */
#define PIO1_16         47       /**< \brief PIO1_16引脚号 */
#define PIO1_17         48       /**< \brief PIO1_17引脚号 */
#define PIO1_18         49       /**< \brief PIO1_18引脚号 */
#define PIO1_19         50       /**< \brief PIO1_19引脚号 */
#define PIO1_20         51       /**< \brief PIO1_20引脚号 */
#define PIO1_21         52       /**< \brief PIO1_21引脚号 */

/** @} */

/** 
 * \name LPC82x 引脚数
 * @{
 */
 
/** \brief 支持最大引脚数是54 */
#define LPC84X_PIN_NUM         54

/** @} */
 
/** 
 * \name LPC82x 引脚可转移功能
 *
 * 每个I/O引脚都可配置为以下功能
 *
 * @{
 */

/** \brief UART0_TXD  功能 */
#define PIO_FUNC_U0_TXD          AM_LPC84X_GPIO_FUNC_U0_TXD

/** \brief UART0_RXD  功能 */
#define PIO_FUNC_U0_RXD          AM_LPC84X_GPIO_FUNC_U0_RXD

/** \brief UART0_RTS  功能 */
#define PIO_FUNC_U0_RTS          AM_LPC84X_GPIO_FUNC_U0_RTS

/** \brief UART0_CTS  功能 */
#define PIO_FUNC_U0_CTS          AM_LPC84X_GPIO_FUNC_U0_CTS

/** \brief UART0_SCLK 功能 */
#define PIO_FUNC_U0_SCLK         AM_LPC84X_GPIO_FUNC_U0_SCLK

/** \brief UART1_TXD  功能 */
#define PIO_FUNC_U1_TXD          AM_LPC84X_GPIO_FUNC_U1_TXD

/** \brief UART1_RXD  功能 */
#define PIO_FUNC_U1_RXD          AM_LPC84X_GPIO_FUNC_U1_RXD

/** \brief UART1_RTS  功能 */
#define PIO_FUNC_U1_RTS          AM_LPC84X_GPIO_FUNC_U1_RTS

/** \brief UART1_CTS  功能 */
#define PIO_FUNC_U1_CTS          AM_LPC84X_GPIO_FUNC_U1_CTS

/** \brief UART1_SCLK 功能 */
#define PIO_FUNC_U1_SCLK         AM_LPC84X_GPIO_FUNC_U1_SCLK

/** \brief UART2_TXD  功能 */
#define PIO_FUNC_U2_TXD          AM_LPC84X_GPIO_FUNC_U2_TXD

/** \brief UART2_RXD  功能 */
#define PIO_FUNC_U2_RXD          AM_LPC84X_GPIO_FUNC_U2_RXD

/** \brief UART2_RTS  功能 */
#define PIO_FUNC_U2_RTS          AM_LPC84X_GPIO_FUNC_U2_RTS

/** \brief UART2_CTS  功能 */
#define PIO_FUNC_U2_CTS          AM_LPC84X_GPIO_FUNC_U2_CTS

/** \brief UART2_SCLK 功能 */
#define PIO_FUNC_U2_SCLK         AM_LPC84X_GPIO_FUNC_U2_SCLK

/** \brief SPI0_SCK   功能 */
#define PIO_FUNC_SPI0_SCK        AM_LPC84X_GPIO_FUNC_SPI0_SCK

/** \brief SPI0_MOSI  功能 */
#define PIO_FUNC_SPI0_MOSI       AM_LPC84X_GPIO_FUNC_SPI0_MOSI

/** \brief SPI0_MISO  功能 */
#define PIO_FUNC_SPI0_MISO       AM_LPC84X_GPIO_FUNC_SPI0_MISO

