zohar123/ametal/soc/nxp/lpc845/lpc84x_pin.h
#define PIO0_4_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO0_4_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO0_4_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO0_4_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_4 滤波分频
 * @{
 */

#define PIO0_4_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO0_4_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO0_4_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO0_4_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO0_4_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO0_4_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO0_4_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_5 固定功能
 * @{
 */

#define PIO0_5_GPIO        AM_LPC84X_GPIO_FUNC_GPIO     /**< \brief GPIO     */
#define PIO0_5_RESETN      AM_LPC84X_GPIO_FUNC_OTHER1   /**< \brief RESETN   */

/** @} */

/**
 * \name PIO0_5 GPIO方向
 * @{
 */

#define PIO0_5_GPIO_INPUT            AM_LPC84X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_5_GPIO_OUTPUT_INIT_HIGH AM_LPC84X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_5_GPIO_OUTPUT_INIT_LOW  AM_LPC84X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_5 引脚模式
 * @{
 */
#define PIO0_5_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO0_5_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO0_5_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO0_5_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO0_5_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_5 输入极性
 * @{
 */
#define PIO0_5_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO0_5_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO0_5 迟滞
 * @{
 */
#define PIO0_5_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO0_5_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO0_5 滤波周期
 * @{
 */

#define PIO0_5_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO0_5_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO0_5_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO0_5_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_5 滤波分频
 * @{
 */

#define PIO0_5_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO0_5_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO0_5_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO0_5_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO0_5_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO0_5_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO0_5_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_6 固定功能
 * @{
 */

#define PIO0_6_GPIO        AM_LPC84X_GPIO_FUNC_GPIO     /**< \brief GPIO     */
#define PIO0_6_VDDCMP      AM_LPC84X_GPIO_FUNC_OTHER1   /**< \brief VDDCMP   */
#define PIO0_6_ADC_1       AM_LPC84X_GPIO_FUNC_OTHER2   /**< \brief ADC_1    */

/** @} */

/**
 * \name PIO0_6 GPIO方向
 * @{
 */

#define PIO0_6_GPIO_INPUT            AM_LPC84X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_6_GPIO_OUTPUT_INIT_HIGH AM_LPC84X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_6_GPIO_OUTPUT_INIT_LOW  AM_LPC84X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_6 引脚模式
 * @{
 */

#define PIO0_6_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO0_6_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO0_6_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO0_6_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO0_6_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_6 输入极性
 * @{
 */

#define PIO0_6_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO0_6_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO0_6 迟滞
 * @{
 */

#define PIO0_6_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO0_6_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO0_6 滤波周期
 * @{
 */

#define PIO0_6_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO0_6_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO0_6_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO0_6_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_6 滤波分频
 * @{
 */

#define PIO0_6_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO0_6_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO0_6_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO0_6_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO0_6_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO0_6_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO0_6_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_7 固定功能
 * @{
 */

#define PIO0_7_GPIO        AM_LPC84X_GPIO_FUNC_GPIO     /**< \brief GPIO     */
#define PIO0_7_ADC_0       AM_LPC84X_GPIO_FUNC_OTHER1   /**< \brief ADC_0    */

/** @} */

/**
 * \name PIO0_7 GPIO方向
 * @{
 */

#define PIO0_7_GPIO_INPUT            AM_LPC84X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_7_GPIO_OUTPUT_INIT_HIGH AM_LPC84X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_7_GPIO_OUTPUT_INIT_LOW  AM_LPC84X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_7 引脚模式
 * @{
 */

