zohar123/ametal/soc/nxp/lpc845/lpc84x_pin.h
#define PIO0_10_GPIO        AM_LPC84X_GPIO_FUNC_GPIO     /**< \brief GPIO    */
#define PIO0_10_I2C0_SCL    AM_LPC84X_GPIO_FUNC_OTHER1   /**< \brief I2C0_SCL*/

/** @} */

/**
 * \name PIO0_10 GPIO方向
 * @{
 */

#define PIO0_10_GPIO_INPUT            AM_LPC84X_GPIO_INPUT        /**< \brief 输入    */
#define PIO0_10_GPIO_OUTPUT_INIT_HIGH AM_LPC84X_GPIO_OUTPUT_HIGH  /**< \brief 输出高  */
#define PIO0_10_GPIO_OUTPUT_INIT_LOW  AM_LPC84X_GPIO_OUTPUT_LOW   /**< \brief 输出低  */

/** @} */

/**
 * \name PIO0_10 输入极性
 * @{
 */

#define PIO0_10_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_10_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_10 迟滞
 * @{
 */
#define PIO0_10_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_10_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_10 滤波周期
 * @{
 */

#define PIO0_10_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO0_10_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO0_10_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO0_10_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_10 滤波分频
 * @{
 */

#define PIO0_10_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_10_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_10_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_10_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_10_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_10_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_10_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/**
 * \name PIO0_10 I2C模式
 * @{
 */

/** \brief 标准/快速模式 */
#define PIO0_10_FAST_STD_MODE   AM_LPC84X_GPIO_I2C_CODE(0x0)

/** \brief GPIO模式      */
#define PIO0_10_FAST_IO_MODE    AM_LPC84X_GPIO_I2C_CODE(0x1)

/** \brief 超快速模式    */
#define PIO0_10_FAST_PLUS_MODE  AM_LPC84X_GPIO_I2C_CODE(0x2)


/** @} */

/******************************************************************************/

/**
 * \name PIO0_11 固定功能
 * @{
 */

#define PIO0_11_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO0_11_I2C0_SDA    AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief I2C0_SDA */

/** @} */

/**
 * \name PIO0_11 GPIO方向
 * @{
 */

#define PIO0_11_GPIO_INPUT            AM_LPC84X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_11_GPIO_OUTPUT_INIT_HIGH AM_LPC84X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_11_GPIO_OUTPUT_INIT_LOW  AM_LPC84X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_11 输入极性
 * @{
 */

#define PIO0_11_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE /**< \brief 不反转   */
#define PIO0_11_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE  /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_11 迟滞
 * @{
 */

#define PIO0_11_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE /**< \brief 不开启   */
#define PIO0_11_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE  /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_11 滤波周期
 * @{
 */

#define PIO0_11_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_11_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_11_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_11_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_11 滤波分频
 * @{
 */

#define PIO0_11_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_11_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_11_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_11_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_11_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_11_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_11_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/**
 * \name PIO0_11 I2C模式
 * @{
 */

/** \brief 标准/快速模式 */
#define PIO0_11_FAST_STD_MODE  AM_LPC84X_GPIO_I2C_CODE(0x0)

/** \brief GPIO模式      */
#define PIO0_11_FAST_IO_MODE   AM_LPC84X_GPIO_I2C_CODE(0x1)

/** \brief 超快速模式    */
#define PIO0_11_FAST_PLUS_MODE AM_LPC84X_GPIO_I2C_CODE(0x2)

/** @} */

/******************************************************************************/

/**
 * \name PIO0_12 固定功能
 * @{
 */

#define PIO0_12_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO0_12 GPIO方向
 * @{
 */

#define PIO0_12_GPIO_INPUT            AM_LPC84X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_12_GPIO_OUTPUT_INIT_HIGH AM_LPC84X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_12_GPIO_OUTPUT_INIT_LOW  AM_LPC84X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_12 引脚模式
 * @{
 */

#define PIO0_12_INACTIVE    AM_LPC84X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_12_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_12_PULLUP      AM_LPC84X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_12_REPEATER    AM_LPC84X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_12_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_12 输入极性
 * @{
 */

#define PIO0_12_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_12_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_12 迟滞
 * @{
 */
#define PIO0_12_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_12_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_12 滤波周期
 * @{
 */

#define PIO0_12_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_12_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_12_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_12_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_12 滤波分频
 * @{
 */
 
#define PIO0_12_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_12_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_12_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_12_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_12_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_12_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_12_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_13 固定功能
 * @{
 */

#define PIO0_13_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO0_13_ADC_10      AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief ADC_10   */

/** @} */

/**
 * \name PIO0_13 GPIO方向
 * @{
 */

#define PIO0_13_GPIO_INPUT            AM_LPC84X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_13_GPIO_OUTPUT_INIT_HIGH AM_LPC84X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_13_GPIO_OUTPUT_INIT_LOW  AM_LPC84X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_13 引脚模式
 * @{
 */

