zohar123/ametal/soc/nxp/lpc845/lpc84x_pin.h
#define PIO0_20_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO0_20_ADC_6       AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief ADC_6    */

/** @} */

/**
 * \name PIO0_20 GPIO方向
 * @{
 */

#define PIO0_20_GPIO_INPUT            AM_LPC84X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_20_GPIO_OUTPUT_INIT_HIGH AM_LPC84X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_20_GPIO_OUTPUT_INIT_LOW  AM_LPC84X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_20 引脚模式
 * @{
 */

#define PIO0_20_INACTIVE    AM_LPC84X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_20_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_20_PULLUP      AM_LPC84X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_20_REPEATER    AM_LPC84X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_20_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_20 输入极性
 * @{
 */

#define PIO0_20_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_20_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_20 迟滞
 * @{
 */

#define PIO0_20_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_20_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_20 滤波周期
 * @{
 */

#define PIO0_20_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_20_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_20_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_20_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_20 滤波分频
 * @{
 */

#define PIO0_20_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_20_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_20_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_20_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_20_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_20_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_20_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_21 固定功能
 * @{
 */

#define PIO0_21_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO0_21_ADC_5       AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief ADC_5    */

/** @} */

/**
 * \name PIO0_21 GPIO方向
 * @{
 */

#define PIO0_21_GPIO_INPUT            AM_LPC84X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_21_GPIO_OUTPUT_INIT_HIGH AM_LPC84X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_21_GPIO_OUTPUT_INIT_LOW  AM_LPC84X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_21 引脚模式
 * @{
 */

#define PIO0_21_INACTIVE    AM_LPC84X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_21_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_21_PULLUP      AM_LPC84X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_21_REPEATER    AM_LPC84X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_21_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_21 输入极性
 * @{
 */

#define PIO0_21_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_21_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_21 迟滞
 * @{
 */

#define PIO0_21_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_21_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_21 滤波周期
 * @{
 */

#define PIO0_21_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_21_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_21_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_21_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_21 滤波分频
 * @{
 */

#define PIO0_21_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_21_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_21_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_21_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_21_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_21_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_21_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_22 固定功能
 * @{
 */

#define PIO0_22_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO0_22_ADC_4       AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief ADC_4    */

/** @} */

/**
 * \name PIO0_22 GPIO方向
 * @{
 */

#define PIO0_22_GPIO_INPUT            AM_LPC84X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_22_GPIO_OUTPUT_INIT_HIGH AM_LPC84X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_22_GPIO_OUTPUT_INIT_LOW  AM_LPC84X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_22 引脚模式
 * @{
 */

#define PIO0_22_INACTIVE    AM_LPC84X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_22_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_22_PULLUP      AM_LPC84X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_22_REPEATER    AM_LPC84X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_22_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_22 输入极性
 * @{
 */

#define PIO0_22_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_22_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_22 迟滞
 * @{
 */

#define PIO0_22_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_22_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_22 滤波周期
 * @{
 */

