zohar123/ametal/soc/nxp/lpc845/lpc84x_pin.h
#define PIO1_0_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_0_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_0_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_0_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_0_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_0 输入极性
 * @{
 */

#define PIO1_0_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_0_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_0 迟滞
 * @{
 */
#define PIO1_0_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_0_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_0 滤波周期
 * @{
 */

#define PIO1_0_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_0_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_0_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_0_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_0 滤波分频
 * @{
 */

#define PIO1_0_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_0_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_0_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_0_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_0_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_0_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_0_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */

/**
 * \name PIO1_1 固定功能
 * @{
 */
#define PIO1_1_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO1_1_CAPT_X2     AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief ADC_9    */
/** @} */

/**
 * \name PIO1_1 引脚模式
 * @{
 */

#define PIO1_1_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_1_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_1_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_1_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_1_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_1 输入极性
 * @{
 */

#define PIO1_1_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_1_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_1 迟滞
 * @{
 */
#define PIO1_1_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_1_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_1 滤波周期
 * @{
 */

#define PIO1_1_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_1_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_1_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_1_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_1 滤波分频
 * @{
 */

#define PIO1_1_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_1_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_1_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_1_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_1_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_1_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_1_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */

/**
 * \name PIO1_2 固定功能
 * @{
 */
#define PIO1_2_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO1_2_CAPT_X3     AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief ADC_9    */

/** @} */

/**
 * \name PIO1_2 引脚模式
 * @{
 */

#define PIO1_2_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_2_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_2_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_2_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_2_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_2 输入极性
 * @{
 */

#define PIO1_2_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_2_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_2 迟滞
 * @{
 */
#define PIO1_2_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_2_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_2 滤波周期
 * @{
 */

#define PIO1_2_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_2_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_2_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_2_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_2 滤波分频
 * @{
 */

#define PIO1_2_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_2_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_2_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_2_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_2_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_2_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_2_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */

/**
 * \name PIO1_3 固定功能
 * @{
 */
#define PIO1_3_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO1_3_CAPT_X4     AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief ADC_9    */

/** @} */

/**
 * \name PIO1_3 引脚模式
 * @{
 */

#define PIO1_3_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_3_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_3_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_3_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_3_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_3 输入极性
 * @{
 */

