zohar123/ametal/soc/nxp/lpc845/lpc84x_pin.h
#define PIO1_3_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_3_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_3 迟滞
 * @{
 */
#define PIO1_3_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_3_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_3 滤波周期
 * @{
 */

#define PIO1_3_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_3_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_3_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_3_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_3 滤波分频
 * @{
 */

#define PIO1_3_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_3_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_3_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_3_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_3_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_3_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_3_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */

/**
 * \name PIO1_4 固定功能
 * @{
 */
#define PIO1_4_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO1_4_CAPT_X5     AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief ADC_9    */

/** @} */

/**
 * \name PIO1_3 引脚模式
 * @{
 */

#define PIO1_4_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_4_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_4_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_4_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_4_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_4 输入极性
 * @{
 */

#define PIO1_4_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_4_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_4 迟滞
 * @{
 */
#define PIO1_4_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_4_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_4 滤波周期
 * @{
 */

#define PIO1_4_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_4_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_4_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_4_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_4 滤波分频
 * @{
 */

#define PIO1_4_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_4_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_4_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_4_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_4_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_4_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_4_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_5 固定功能
 * @{
 */
#define PIO1_5_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO1_5_CAPT_X6     AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief ADC_9    */

/** @} */

/**
 * \name PIO1_5 引脚模式
 * @{
 */

#define PIO1_5_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_5_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_5_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_5_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_5_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_5 输入极性
 * @{
 */

#define PIO1_5_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_5_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_5 迟滞
 * @{
 */
#define PIO1_5_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_5_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_5 滤波周期
 * @{
 */

#define PIO1_5_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_5_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_5_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_5_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_5 滤波分频
 * @{
 */

#define PIO1_5_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_5_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_5_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_5_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_5_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_5_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_5_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_6 固定功能
 * @{
 */
#define PIO1_6_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO1_6_CAPT_X7     AM_LPC84X_GPIO_FUNC_OTHER1  /**< \brief ADC_9    */

/** @} */

/**
 * \name PIO1_6 引脚模式
 * @{
 */

#define PIO1_6_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_6_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_6_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_6_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_6_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_6 输入极性
 * @{
 */

#define PIO1_6_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_6_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_6 迟滞
 * @{
 */
#define PIO1_6_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_6_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_6 滤波周期
 * @{
 */

#define PIO1_6_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_6_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_6_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_6_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_6 滤波分频
 * @{
 */

