zohar123/ametal/soc/nxp/lpc845/lpc84x_pin.h
#define PIO1_10_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_10_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_10_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_10_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_10_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_10 输入极性
 * @{
 */

#define PIO1_10_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_10_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_10 迟滞
 * @{
 */
#define PIO1_10_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_10_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_10 滤波周期
 * @{
 */

#define PIO1_10_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_10_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_10_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_10_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_10 滤波分频
 * @{
 */

#define PIO1_10_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_10_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_10_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_10_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_10_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_10_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_10_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_11 固定功能
 * @{
 */
#define PIO1_11_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
/** @} */

/**
 * \name PIO1_11 引脚模式
 * @{
 */

#define PIO1_11_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_11_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_11_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_11_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_11_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_11 输入极性
 * @{
 */

#define PIO1_11_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_11_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_11 迟滞
 * @{
 */
#define PIO1_11_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_11_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_11 滤波周期
 * @{
 */

#define PIO1_11_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_11_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_11_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_11_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_11 滤波分频
 * @{
 */

#define PIO1_11_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_11_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_11_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_11_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_11_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_11_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_11_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */

/** @} */


/**
 * \name PIO1_12 固定功能
 * @{
 */
#define PIO1_12_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
/** @} */

/**
 * \name PIO1_12 引脚模式
 * @{
 */

#define PIO1_12_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_12_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_12_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_12_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_12_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_12 输入极性
 * @{
 */

#define PIO1_12_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_12_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_12 迟滞
 * @{
 */
#define PIO1_12_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_12_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_12 滤波周期
 * @{
 */

#define PIO1_12_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_12_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_12_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_12_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_12 滤波分频
 * @{
 */

#define PIO1_12_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_12_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_12_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_12_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_12_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_12_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_12_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_13 固定功能
 * @{
 */
#define PIO1_13_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO1_13 引脚模式
 * @{
 */

#define PIO1_13_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_13_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_13_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_13_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_13_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_13 输入极性
 * @{
 */

#define PIO1_13_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_13_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_13 迟滞
 * @{
 */
#define PIO1_13_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_13_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_13 滤波周期
 * @{
 */

