zohar123/ametal/soc/nxp/lpc845/lpc84x_pin.h
#define PIO1_13_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_13_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_13_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_13_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_13 滤波分频
 * @{
 */

#define PIO1_13_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_13_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_13_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_13_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_13_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_13_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_13_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_14 固定功能
 * @{
 */
#define PIO1_14_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO1_14 引脚模式
 * @{
 */

#define PIO1_14_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_14_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_14_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_14_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_14_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_14 输入极性
 * @{
 */

#define PIO1_14_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_14_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_14 迟滞
 * @{
 */
#define PIO1_14_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_14_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_14 滤波周期
 * @{
 */

#define PIO1_14_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_14_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_14_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_14_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_14 滤波分频
 * @{
 */

#define PIO1_14_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_14_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_14_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_14_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_14_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_14_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_14_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_15 固定功能
 * @{
 */
#define PIO1_15_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
/** @} */

/**
 * \name PIO1_15 引脚模式
 * @{
 */

#define PIO1_15_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_15_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_15_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_15_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_15_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_15 输入极性
 * @{
 */

#define PIO1_15_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_15_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_15 迟滞
 * @{
 */
#define PIO1_15_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_15_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_15 滤波周期
 * @{
 */

#define PIO1_15_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_15_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_15_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_15_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_15 滤波分频
 * @{
 */

#define PIO1_15_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_15_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_15_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_15_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_15_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_15_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_15_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_16 固定功能
 * @{
 */
#define PIO1_16_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO1_16 引脚模式
 * @{
 */

#define PIO1_16_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_16_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_16_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_16_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_16_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_16 输入极性
 * @{
 */

#define PIO1_16_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_16_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_16 迟滞
 * @{
 */
#define PIO1_16_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_16_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_16 滤波周期
 * @{
 */

#define PIO1_16_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_16_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_16_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_16_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_16 滤波分频
 * @{
 */

