zohar123/ametal/soc/nxp/lpc845/lpc84x_pin.h
#define PIO1_16_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_16_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_16_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_16_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_16_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_16_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_16_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_17 固定功能
 * @{
 */
#define PIO1_17_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO1_17 引脚模式
 * @{
 */

#define PIO1_17_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_17_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_17_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_17_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_17_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_17 输入极性
 * @{
 */

#define PIO1_17_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_17_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_17 迟滞
 * @{
 */
#define PIO1_17_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_17_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_17 滤波周期
 * @{
 */

#define PIO1_17_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_17_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_17_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_17_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_17 滤波分频
 * @{
 */

#define PIO1_17_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_17_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_17_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_17_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_17_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_17_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_17_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_18 固定功能
 * @{
 */
#define PIO1_18_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
/** @} */

/**
 * \name PIO1_18 引脚模式
 * @{
 */

#define PIO1_18_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_18_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_18_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_18_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_18_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_18 输入极性
 * @{
 */

#define PIO1_18_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_18_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_18 迟滞
 * @{
 */
#define PIO1_18_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_18_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_18 滤波周期
 * @{
 */

#define PIO1_18_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_18_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_18_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_18_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_18 滤波分频
 * @{
 */

#define PIO1_18_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_18_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_18_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_18_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_18_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_18_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_18_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_19 固定功能
 * @{
 */
#define PIO1_19_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO1_19 引脚模式
 * @{
 */

#define PIO1_19_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_19_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_19_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_19_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_19_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_19 输入极性
 * @{
 */

#define PIO1_19_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_19_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_19 迟滞
 * @{
 */
#define PIO1_19_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_19_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_19 滤波周期
 * @{
 */

#define PIO1_19_FIL_DISABLE AM_LPC84X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO1_19_FIL_1CYCLE  AM_LPC84X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO1_19_FIL_2CYCLE  AM_LPC84X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO1_19_FIL_3CYCLE  AM_LPC84X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO1_19 滤波分频
 * @{
 */

#define PIO1_19_FIL_DIV0    AM_LPC84X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO1_19_FIL_DIV1    AM_LPC84X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO1_19_FIL_DIV2    AM_LPC84X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO1_19_FIL_DIV3    AM_LPC84X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO1_19_FIL_DIV4    AM_LPC84X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO1_19_FIL_DIV5    AM_LPC84X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO1_19_FIL_DIV6    AM_LPC84X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */
/** @} */


/**
 * \name PIO1_20 固定功能
 * @{
 */
#define PIO1_20_GPIO        AM_LPC84X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
/** @} */

/**
 * \name PIO1_20 引脚模式
 * @{
 */

#define PIO1_20_INACTIVE    AM_LPC84X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO1_20_PULLDOWN    AM_LPC84X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO1_20_PULLUP      AM_LPC84X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO1_20_REPEATER    AM_LPC84X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO1_20_OPEN_DRAIN  AM_LPC84X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO1_20 输入极性
 * @{
 */

#define PIO1_20_INV_DISABLE AM_LPC84X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO1_20_INV_ENABLE  AM_LPC84X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO1_20 迟滞
 * @{
 */
#define PIO1_20_HYS_DISABLE AM_LPC84X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO1_20_HYS_ENABLE  AM_LPC84X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO1_20 滤波周期
 * @{
 */

